"""
pandas.date_range(start=None, end=None, periods=None, freq=’D’, tz=None, normalize=False, name=None, closed=None, **kwargs)
Return a fixed frequency datetime index, with day (calendar) as the default frequency
用于生成一个指定长度的DateIndex

start:string or datetime-like, default None
    日期的起点
end:string or datetime-like, default None
    日期的终点
period:integer or None, default None
    表示要从这个函数中产生多少个日期索引值，如果为None的话，start和end不能为None
freq:string or DateOffset，默认为D
    表示以自然日为单位，这个参数用来设定计时单位，比如'5H'代表每5小时计算一次
tz:string or None
    表示时区
name:str,default None
    给返回的时间索引指定一个名字
normalize:default True
    如果为True的话，那么在产生时间索引值之前会先把start和end都转化为当日的午夜0点
"""

import pandas as pd
import numpy as np
from pandas import DataFrame, Series

longer_ts = Series(np.random.randn(100),
                   index=pd.date_range('3/1/2000', periods=100))
print(longer_ts)
"""
2000-03-01   -0.140998
2000-03-02   -1.669196
2000-03-03   -0.015409
2000-03-04    0.311671
2000-03-05    0.815886
2000-03-06    0.172290
2000-03-07    0.006515
2000-03-08   -0.821384
2000-03-09   -0.072800
2000-03-10   -0.481546
2000-03-11   -1.911931
2000-03-12   -0.219916
2000-03-13   -0.867847
2000-03-14   -1.640519
2000-03-15   -1.177075
2000-03-16   -0.102387
2000-03-17    0.110553
2000-03-18    0.811723
2000-03-19    0.770885
2000-03-20   -1.091376
2000-03-21    0.861408
2000-03-22   -0.201409
2000-03-23   -0.146933
2000-03-24    1.094079
2000-03-25    0.974703
2000-03-26    1.810763
2000-03-27    0.972470
2000-03-28   -1.983746
2000-03-29    0.257432
2000-03-30   -0.429860
                ...
2000-05-10    0.198056
2000-05-11    0.811612
2000-05-12   -1.596158
2000-05-13    1.127871
2000-05-14   -1.703350
2000-05-15   -0.373238
2000-05-16   -0.471880
2000-05-17   -2.068865
2000-05-18   -0.289061
2000-05-19    0.042372
2000-05-20   -1.642339
2000-05-21    0.549208
2000-05-22   -0.384394
2000-05-23   -1.173041
2000-05-24   -1.703172
2000-05-25    0.644181
2000-05-26    2.227454
2000-05-27    1.301403
2000-05-28   -1.550159
2000-05-29    1.283581
2000-05-30   -1.379619
2000-05-31    0.147162
2000-06-01   -0.679666
2000-06-02   -1.229367
2000-06-03   -2.421757
2000-06-04   -2.584276
2000-06-05   -0.748913
2000-06-06    0.181287
2000-06-07    1.716045
2000-06-08    0.425941
Freq: D, dtype: float64
"""